###################################################################

# Created by write_sdc on Sun Mar 12 13:25:05 2017

###################################################################
set sdc_version 1.9

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_max_area 0
set_max_fanout 4 [current_design]
create_clock [get_ports Hclk]  -period 3  -waveform {0 1.5}
set_clock_uncertainty -setup 0.2  [get_clocks Hclk]
set_output_delay -clock Hclk  -max 1.2  [get_ports Hready_out]
set_output_delay -clock Hclk  -max 1.2  [get_ports Penable]
set_output_delay -clock Hclk  -max 1.2  [get_ports Pselx]
set_output_delay -clock Hclk  -max 1.2  [get_ports Pwrite]
set_output_delay -clock Hclk  -max 1.2  [get_ports test_so]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Hrdata[31]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Hrdata[30]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Hrdata[29]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Hrdata[28]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Hrdata[27]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Hrdata[26]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Hrdata[25]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Hrdata[24]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Hrdata[23]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Hrdata[22]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Hrdata[21]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Hrdata[20]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Hrdata[19]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Hrdata[18]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Hrdata[17]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Hrdata[16]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Hrdata[15]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Hrdata[14]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Hrdata[13]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Hrdata[12]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Hrdata[11]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Hrdata[10]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Hrdata[9]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Hrdata[8]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Hrdata[7]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Hrdata[6]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Hrdata[5]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Hrdata[4]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Hrdata[3]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Hrdata[2]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Hrdata[1]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Hrdata[0]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Pwdata[31]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Pwdata[30]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Pwdata[29]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Pwdata[28]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Pwdata[27]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Pwdata[26]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Pwdata[25]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Pwdata[24]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Pwdata[23]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Pwdata[22]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Pwdata[21]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Pwdata[20]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Pwdata[19]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Pwdata[18]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Pwdata[17]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Pwdata[16]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Pwdata[15]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Pwdata[14]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Pwdata[13]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Pwdata[12]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Pwdata[11]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Pwdata[10]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Pwdata[9]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Pwdata[8]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Pwdata[7]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Pwdata[6]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Pwdata[5]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Pwdata[4]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Pwdata[3]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Pwdata[2]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Pwdata[1]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Pwdata[0]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Paddr[31]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Paddr[30]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Paddr[29]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Paddr[28]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Paddr[27]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Paddr[26]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Paddr[25]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Paddr[24]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Paddr[23]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Paddr[22]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Paddr[21]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Paddr[20]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Paddr[19]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Paddr[18]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Paddr[17]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Paddr[16]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Paddr[15]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Paddr[14]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Paddr[13]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Paddr[12]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Paddr[11]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Paddr[10]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Paddr[9]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Paddr[8]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Paddr[7]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Paddr[6]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Paddr[5]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Paddr[4]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Paddr[3]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Paddr[2]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Paddr[1]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Paddr[0]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Hresp[1]}]
set_output_delay -clock Hclk  -max 1.2  [get_ports {Hresp[0]}]
